In [1]:
import pandas as p

In [3]:
p.read_excel(r'C:\Users\ehsan\OneDrive\Desktop\DataSet1.xlsx')

    Name  Batch  Roll No     Address
0   Ehsan  P-11        11      Pakur
1  Faisal  P-12        12      Delhi
2  Faizal  P-13        13  Bangalore

In [8]:
p.read_csv(r'C:\Users\ehsan\OneDrive\Desktop\DataSet2.csv')

    Name  Batch  Roll No     Address
0   Ehsan  P-11        11      Pakur
1  Faisal  P-12        12      Delhi
2  Faizal  P-13        13  Bangalore
3   Rahul  P-14        14       Kota
4   Ankit  P-15        15    Kolkata
5   Sumit  P-16        16       Pune

In [15]:
p.read_csv(r'C:\Users\ehsan\OneDrive\Desktop\DataSet3.txt',sep='\t')

  Name Class RollNo Grade
0    Ehsan 10   01     A++
1   Ankit 10   02     A+++
2    Faisal10   03     A++